-- ============================================================
-- RFM-анализ покупателей
-- ============================================================

-- ------------------------------------------------------------
-- Шаг 1. Проверка качества данных
-- Считаем количество и долю идентифицированных и неидентифицированных покупателей
-- ------------------------------------------------------------
select case when length(card) = 13 then 'identified' else 'not_identified' end as customer
     , count(*) as qty
     , to_char(round(count(*) / sum(count(*)) over() * 100), '99 %') as perc
  from bonuscheques
 group by customer;
